# 赋值语句知识点

print("一、赋值语句的一般形式:\n\n\
      \t<变量>=<表达式>")        # 这里用到了反斜杠续行

print()
print("二、<表达式> 是数据和操作符按规则连接的代码片段")

print()
print("三、元组赋值语句")
print()
print("\t<变量1>,...,<变量N>=<表达式1>,...,<表达式N>")
print("\t等号右侧的表达式同时计算，并一一赋值给等号左侧的变量")


print()
print("四、多目标赋值语句")
print()
print("\t<变量1>=<变量2>=...=<变量N>=<表达式>")
print("\t这种写法可以将等号右侧的表达式的值同时赋值给左侧所有变量")

print()
print("知识点讲述完毕")

print("一个非常方便的语法如下:")
print()

print("现在定义两个变量，\na = 1,b = 0")

a = 1
b = 0

print("如果我要交换两个变量值，\n也就是将现在变量a中的值赋值给b，\n将现在变量b中的值赋值给a")
print("我们可以使用a,b=b,a来交换ab的值")

print("交换前:","a =",a,"b =",b)

a,b = b,a

print("交换后:","a =",a,"b =",b)

print("这个语法很方便，不用像C语言要通过定义一个中间变量来交换两个变量的值")
